app/Controllers/Atas.php

    public function dadosAtas()
    {
        $db = db_connect();
        $builder = $db->table('tbatas a');
        $builder->select('a.cod, a.data, a.descricao, s.descricao as descsetor, a.participantes ');
        $builder->join('tbsetores s', 's.cod = a.codsetor');
        $builder->orderBy('a.cod', 'ASC');
        $query = $builder->get();
---
SELECT `a`.`cod`, `a`.`data`, `a`.`descricao`, `s`.`descricao` as `descsetor`, `a`.`participantes`
FROM `tbatas` `a`
JOIN `tbsetores` `s` ON `s`.`cod` = `a`.`codsetor`
ORDER BY `a`.`cod` ASC

    public function dadosSetores()
    {
        $db = db_connect();
        $builder = $db->table('tbsetores s');
        $builder->select('s.cod, s.descricao ');
        $query = $builder->get();
---
SELECT `s`.`cod`, `s`.`descricao`
FROM `tbsetores` `s`