app/Controllers/Envolvidos.php

SELECT `e`.`cod`, `e`.`nome`, `s`.`descricao`
FROM `tbenvolvidos` `e`
JOIN `tbsetores` `s` ON `s`.`cod` = `e`.`codsetor`
ORDER BY `e`.`cod` ASC
---
    public function dadosEnvolvidos()
    {
        $db = db_connect();
        $builder = $db->table('tbenvolvidos e');
        $builder->select('e.cod, e.nome, s.descricao');
        $builder->join('tbsetores s', 's.cod = e.codsetor');
        $builder->orderBy('e.cod', 'ASC');
        $query = $builder->get();