app/Controllers/Legalizacao.php

SELECT *
FROM `tbempresas`
SELECT *
FROM `tbclientes`
ORDER BY `nome` ASC
SELECT *
FROM `tbprocessosservicos`
ORDER BY `nome` ASC
SELECT *
FROM `tbenvolvidos`
SELECT *
FROM `tbstatus`
SELECT *
FROM `tbprocessosdetalhes`
WHERE `codprocesso` = '154'
ORDER BY `cod` DESC
SELECT *
FROM `tbusuarios`
SELECT *
FROM `tbprocessosdocumentos`
---
    public function processosDetalhes($cod)
    {

        return view('processosdetalhes', [
            'processo'      => $this->tbprocessos->where('cod', $cod)->first(),
            'empresas'      => $this->tbempresas->find(),
            'clientes'      => $this->tbclientes->orderBy('nome', 'ASC')->find(),
            'servicos'      => $this->tbprocessosservicos->orderBy('nome', 'ASC')->find(),
            'envolvidos'    => $this->tbenvolvidos->find(),
            'status'        => $this->tbstatus->find(),
            'processosdetalhes' => $this->tbprocessosdetalhes->where('codprocesso', $cod)->orderBy('cod', 'DESC')->find(),
            'usuarios'      => $this->tbusuarios->find(),
            'processodocumentos' => $this->tbprocessosdocumentos->find()