app/Controllers/Topicos.php

SELECT `a`.`cod`, `a`.`data`, `a`.`descricao`, `st`.`descricao` as `descsetor`
FROM `tbatas` `a`
JOIN `tbsetores` `st` ON `st`.`cod` = `a`.`codsetor`
ORDER BY `a`.`cod` DESC
---
    public function dadosAtas()
    {
        $db = db_connect();
        $builder = $db->table('tbatas a');
        $builder->select('a.cod, a.data, a.descricao, st.descricao as descsetor');
        $builder->join('tbsetores st', 'st.cod = a.codsetor');
        $builder->orderBy('a.cod', 'DESC');
        $query = $builder->get();

SELECT `a`.`data`, `st`.`descricao` as `descsetor`, `t`.`cod` as `codt`, `t`.`assunto`, `t`.`providencia`, `e`.`nome`, `s`.`descricao` as `descstatus`, `t`.`diretoria`, `a`.`cod` as `coda`, `a`.`descricao` as `descata`, `a`.`participantes`
FROM `tbtopicos` `t`
JOIN `tbenvolvidos` `e` ON `e`.`cod` = `t`.`codresponsavel`
JOIN `tbstatus` `s` ON `s`.`cod` = `t`.`codstatus`
JOIN `tbatas` `a` ON `a`.`cod` = `t`.`codata`
JOIN `tbsetores` `st` ON `st`.`cod` = `a`.`codsetor`
WHERE `st`.`cod` = 1
ORDER BY `t`.`cod` DESC
---
    public function dadosReuniao($codSetor)
    {
        $db = db_connect();
        $builder = $db->table('tbtopicos t');
        $builder->select('a.data, st.descricao as descsetor, t.cod as codt, t.assunto, t.providencia, e.nome, s.descricao as descstatus, t.diretoria, a.cod as coda, a.descricao as descata, a.participantes');
        $builder->join('tbenvolvidos e', 'e.cod = t.codresponsavel');
        $builder->join('tbstatus s', 's.cod = t.codstatus');
        $builder->join('tbatas a', 'a.cod = t.codata');
        $builder->join('tbsetores st', 'st.cod = a.codsetor');
        $builder->where('st.cod', $codSetor);
        $builder->orderBy('t.cod', 'DESC');
        $query = $builder->get();

SELECT `e`.`cod`, `e`.`nome`
FROM `tbenvolvidos` `e`
---
    public function dadosEnvolvidos()
    {
        $db = db_connect();
        $builder = $db->table('tbenvolvidos e');
        $builder->select('e.cod, e.nome');
        $query = $builder->get();

SELECT `st`.`cod`, `st`.`descricao`
FROM `tbstatus` `st`
---
    public function dadosStatus()
    {
        $db = db_connect();
        $builder = $db->table('tbstatus st');
        $builder->select('st.cod, st.descricao ');
        $query = $builder->get();

SELECT `s`.`descricao`
FROM `tbsetores` `s`
JOIN `tbatas` `a` ON `a`.`codsetor` = `s`.`cod`
JOIN `tbtopicos` `t` ON `t`.`codata` = `a`.`cod`
WHERE `t`.`cod` = '46'
---
    public function dadosSetor($codTopico)
    {
        $db = db_connect();
        $builder = $db->table('tbsetores s');
        $builder->select('s.descricao');
        $builder->join('tbatas a', 'a.codsetor = s.cod');
        $builder->join('tbtopicos t', 't.codata = a.cod');
        $builder->where('t.cod', $codTopico);
        $query = $builder->get();